12/data/attachments/dc88338a8e487243.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_db3e76ae-7435-480c-8a61-666475832b79</nif:username>
            <nif:friendToBeAdded>Dawn_citizen_Friend_38308_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>